functionalTests/refineWithinSTL/shaft/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel   KriegerDoughertyViscosity;//Newtonian;//

nu              nu [ 0 2 -1 0 0 0 0 ] 0.00100;

CrossPowerLawCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    m               m [ 0 0 1 0 0 0 0 ] 1;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}

BirdCarreauCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    k               k [ 0 0 1 0 0 0 0 ] 0;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}

KriegerDoughertyViscosityCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-03;
    nuMax           nuMax [ 0 2 -1 0 0 0 0 ] 1e+03;
    nuMin           nuMin [ 0 2 -1 0 0 0 0 ] 1e-03;
    nuBar           nuBar [ 0 0 0 0 0 0 0 ] 2.5;
    voidfractionMax voidfractionMax [ 0 0 0 0 0 0 0 ] 0.65;
}
// ************************************************************************* //
